// server/src/app.service.ts

/*
 * -----------------------------------------------------------------------------
 * (คำอธิบายไฟล์)
 * ไฟล์นี้คือ "Service" (บริการ) หรือ "คนทำงาน" หลักของแอปพลิเคชัน
 *
 * นี่คือ "ไฟล์เริ่มต้น" ที่ Nest.js สร้างให้
 * ในโปรเจกต์ขนาดเล็ก มันอาจจะใช้ทำงานเล็กๆ น้อยๆ
 * ในโปรเจกต์ขนาดใหญ่ (อย่างของคุณ) ไฟล์นี้มักจะ "ไม่" ถูกใช้งาน
 * (เพราะเราจะแยก Service ไปตาม "กล่องย่อย" (Module) ของตัวเอง เช่น ProductsService)
 * -----------------------------------------------------------------------------
 */

import { Injectable } from '@nestjs/common';

// (บอก Nest.js ว่า class นี้สามารถ "ฉีด" (Inject) เข้าไปใช้ที่อื่นได้)
@Injectable()
export class AppService {
  // (ฟังก์ชัน `getHello` ที่ Controller เรียกใช้)
  getHello(): string {
    // (ทำงานแค่ "ส่งคืน" (return) ข้อความ "Hello World!" กลับไป)
    return 'Hello World!';
  }
}

/*
 * -----------------------------------------------------------------------------
 * (สรุปการทำงาน)
 * 1. `AppController` (อีกไฟล์) ถูกเรียก (ที่ "/")
 * 2. `AppController` เรียก `this.appService.getHello()` (ไฟล์นี้)
 * 3. `AppService` (ไฟล์นี้) คืนค่า "Hello World!"
 * -----------------------------------------------------------------------------
 */
